app/controllers/posts_controller.rb

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-04-24 06:56:04', 'First Post', 'The $.get uses the href url attribute from our edit link above, makes the ajax call, and returns the response (the edit.html.erb template) to our modal (div#modal_window) dialog displayed using the BlockUI plugin. Whew, that''s a mouthful.', '2009-04-24 06:56:04')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "title" = 'sdfd2323', "body" = 'The $.get uses the href url attribute from ou1adsr edit link above, makes the ajax call, and returns the response (the edit.html.erb template) to our modal (div#modal_window) dialog displayed using the BlockUI plugin. Whew, that''s a mouthful.', "updated_at" = '2009-04-24 08:22:10' WHERE "id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])